from collections import Counter
import string


path = "gaining experience/mini tasks/simple-text.txt"
all_file_text = ""

with open(path, "r") as f:
    text = f.readlines()
    for line in text:
        all_file_text += line.replace("\n", "")


# del all punctuation
all_file_text = all_file_text.translate(str.maketrans('', '', string.punctuation))

words_counts = Counter(all_file_text.lower().split())
print(words_counts)
# Counter({'и': 55, 'не': 43, 'в': 40, 'на': 30, 'она': 21, 'что': 21, 'мы': 17,
# 'я': 17, 'с': 16, 'все': 13, 'он': 13, 'было': 12, 'по': 12, 'как': 12, 'её': 11,
# 'у': 11, 'была': 11, 'это': 11, 'то': 10, 'уже': 10, 'еще': 9, 'теперь': 9,
# 'ты': 9, 'из': 8, 'когда': 8, 'а': 7, 'но': 7, 'только': 7, 'лера': 7, 'они': 7,
# 'был': 6, 'были': 6, 'во': 6, 'за': 6, 'лена': 6, 'от': 6, 'бы': 5, 'сейчас': 5,
# 'люди': 5, 'людей': 5, 'без': 5, 'нас': 4, 'электричество': 4, 'никто': 4, 'просто': 4,
# 'рядом': 4, 'иванович': 4, 'сашок': 4, 'неделю': 4, 'кто': 4, 'него': 4, 'пока': 4,
# 'глазах': 3, 'их': 3, 'видно': 3, 'города': 3, 'стал': 3, 'дом': 3, 'ей': 3, 'перед': 3,
# 'квартиры': 3, 'неё': 3, 'могла': 3, 'после': 3, 'очень': 3, 'шла': 3, 'вокруг': 3,
# 'для': 3, 'дмитрий': 3, 'дима': 3, 'туда': 3, 'идти': 3, 'да': 3, 'тебя': 3, 'нам': 3,
# 'так': 3, 'проблема': 3, 'которые': 3, 'резал': 3, 'даже': 3, 'мне': 3, 'дома': 3,
# 'ничего': 3, 'будет': 3, 'городе': 3, 'там': 3, 'некоторые': 3, 'почему': 3, 'блять': 3,
# 'собой': 3, 'звезды': 2, 'отражались': 2, 'раньше': 2, 'назад': 2, 'свет': 2, 'мерцание': 2,
# 'звезд': 2, 'воздух': 2, 'всех': 2, 'дочка': 2, 'работала': 2, 'каждый': 2, 'тоже': 2,
# 'нет': 2, 'дни': 2, 'знал': 2, 'мужчина': 2, 'сказал': 2, 'дверь': 2, 'улицам': 2, 'знала': 2,
# 'три': 2, 'делать': 2, 'слева': 2, 'оля': 2, 'мужчин': 2, 'девушек': 2, 'устали': 2........

print(words_counts['блять'])  # 3